Applying this causes a rename of an alert (which is fine) and the destruction of an alert of running out of quota that isn't reflected in our terraform config. @yuvipanda is that okay?

```terraform
Terraform will perform the following actions:

  # google_container_node_pool.core must be replaced
-/+ resource "google_container_node_pool" "core" {
      ~ id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster/nodePools/core-pool" -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroupManagers/gke-pilot-hubs-cluster-core-pool-d184c825-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/two-eye-two-see/zones/us-central1-b/instanceGroups/gke-pilot-hubs-cluster-core-pool-d184c825-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
        name                        = "core-pool"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 1 -> (known after apply)
      ~ node_locations              = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.26.4-gke.1400" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ autoscaling {
          ~ location_policy      = "BALANCED" -> (known after apply)
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      ~ node_config {
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "n1-highmem-4" -> "n2-highmem-4" # forces replacement
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
            tags              = []
          ~ taint             = [] -> (known after apply)
            # (7 unchanged attributes hidden)

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }

        # (1 unchanged block hidden)
    }

  # google_monitoring_alert_policy.any_quota_overrun will be destroyed
  # (because google_monitoring_alert_policy.any_quota_overrun is not in configuration)
  - resource "google_monitoring_alert_policy" "any_quota_overrun" {
      - combiner              = "OR" -> null
      - creation_record       = [
          - {
              - mutate_time = "2023-09-10T23:07:37.530172984Z"
              - mutated_by  = "yuvipanda@2i2c.org"
            },
        ] -> null
      - display_name          = "Quota full" -> null
      - enabled               = true -> null
      - id                    = "projects/two-eye-two-see/alertPolicies/11829790890906226277" -> null
      - name                  = "projects/two-eye-two-see/alertPolicies/11829790890906226277" -> null
      - notification_channels = [
          - "projects/two-eye-two-see/notificationChannels/2203982305292521130",
        ] -> null
      - project               = "two-eye-two-see" -> null
      - user_labels           = {} -> null

      - conditions {
          - display_name = "Quota full" -> null
          - name         = "projects/two-eye-two-see/alertPolicies/11829790890906226277/conditions/11829790890906225038" -> null

          - condition_threshold {
              - comparison      = "COMPARISON_GT" -> null
              - duration        = "60s" -> null
              - filter          = <<-EOT
                    metric.type = "serviceruntime.googleapis.com/quota/exceeded"
                    AND resource.type="consumer_quota"
                EOT -> null
              - threshold_value = 0 -> null

              - aggregations {
                  - alignment_period     = "60s" -> null
                  - cross_series_reducer = "REDUCE_SUM" -> null
                  - group_by_fields      = [
                      - "metric.label.quota_metric",
                    ] -> null
                  - per_series_aligner   = "ALIGN_COUNT_TRUE" -> null
                }

              - trigger {
                  - count   = 1 -> null
                  - percent = 0 -> null
                }
            }
        }
    }

  # google_monitoring_alert_policy.disk_space_full_alert will be updated in-place
  ~ resource "google_monitoring_alert_policy" "disk_space_full_alert" {
        id                    = "projects/two-eye-two-see/alertPolicies/15294006241774898378"
        name                  = "projects/two-eye-two-see/alertPolicies/15294006241774898378"
        # (7 unchanged attributes hidden)

      ~ conditions {
          ~ display_name = "Check free space %" -> "Simple Health Check Endpoint"
            name         = "projects/two-eye-two-see/alertPolicies/15294006241774898378/conditions/15294006241774897367"

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 1 to change, 2 to destroy.
```